// প্রতিদিন তোমার কাজ কি? 

// ১) রাত ৮ টা বাজে মডিউল আনলক করো  

// ২) ফটাফট ভিডিও দেখে দেখে প্রাকটিস করো

// ৩) ভিডিও দেখতে দেখতে নোটস নাও 

// ৪) মডিউল শেষ হলে পুরা মডিউল নিজে নিজে প্রাকটিস করো 

// ৫) কোন কিছু বুঝতে না পারলে (চিন্তা করে দেখো এইখানে কিন্তু একটা শর্ত আছে ), সাপোর্ট সেশনে জয়েন করো 

// এখন তোমার কাজ হচ্ছে একটা for লুপ 5 বার চালিয়ে উপরের জিনিসগুলা আউটপুট হিসেবে দেখানো।



// for(var i=1;i<=5;i++){
//     if(i==1){
//       console.log('১) রাত ৮ টা বাজে মডিউল আনলক করো');
        
//     }
//     else if(i==2){
//         console.log('২) ফটাফট ভিডিও দেখে দেখে প্রাকটিস করো');
        
//     }
//     else if(i==3){
//         console.log('৩) ভিডিও দেখতে দেখতে নোটস নাও ');
        
//     }
//     else if(i==4){
//         console.log('৪) মডিউল শেষ হলে পুরা মডিউল নিজে নিজে প্রাকটিস করো ');
        
//     }
//     else if(i==5){
//         console.log('৫) কোন কিছু বুঝতে না পারলে (চিন্তা করে দেখো এইখানে কিন্তু একটা শর্ত আছে ), সাপোর্ট সেশনে জয়েন করো');
        
//     }
// }

// আবার একই জিনিস while লুপ চালিয়ে দেখানো। 

// var i=1;
// while(i<=5){
    
//     if(i==1){
//         console.log('১) রাত ৮ টা বাজে মডিউল আনলক করো');
          
//       }
//       else if(i==2){
//           console.log('২) ফটাফট ভিডিও দেখে দেখে প্রাকটিস করো');
          
//       }
//       else if(i==3){
//           console.log('৩) ভিডিও দেখতে দেখতে নোটস নাও ');
          
//       }
//       else if(i==4){
//           console.log('৪) মডিউল শেষ হলে পুরা মডিউল নিজে নিজে প্রাকটিস করো ');
          
//       }
//       else if(i==5){
//           console.log('৫) কোন কিছু বুঝতে না পারলে (চিন্তা করে দেখো এইখানে কিন্তু একটা শর্ত আছে ), সাপোর্ট সেশনে জয়েন করো');
          
//       }
//       i++;
// }

//উপরের প্রব্লেমটাই while লুপ রিভার্স ওয়েতে (decremental হিসেবে)করে দেখাও 

var i=5;
while(i>=1){
    
        if(i==1){
            console.log('১) রাত ৮ টা বাজে মডিউল আনলক করো');
              
          }
          else if(i==2){
              console.log('২) ফটাফট ভিডিও দেখে দেখে প্রাকটিস করো');
              
          }
          else if(i==3){
              console.log('৩) ভিডিও দেখতে দেখতে নোটস নাও ');
              
          }
          else if(i==4){
              console.log('৪) মডিউল শেষ হলে পুরা মডিউল নিজে নিজে প্রাকটিস করো ');
              
          }
          else if(i==5){
              console.log('৫) কোন কিছু বুঝতে না পারলে (চিন্তা করে দেখো এইখানে কিন্তু একটা শর্ত আছে ), সাপোর্ট সেশনে জয়েন করো');
              
          }
          i--;
    }
